cloud_test.yml
---
execution:
- concurrency: 1500
  hold-for: 20m
  ramp-up: 10m
  locations:
    us-east-1: 2
    us-west-1: 2
    us-east-2: 2
  locations-weighted: false
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php