cloud_test.yml
---
execution:
- concurrency: 1000
  hold-for: 10m
  ramp-up: 5m
  locations:
    us-east-1: 1
    eu-west-1: 1
  locations-weighted: false
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php