taurus_execution.yml
---
execution:
   concurrency: 10000
   hold-for: 10m
   ramp-up: 2m
   locations: 
      eu-central-1: 1
      eu-west-1: 1
      us-east-1: 1
      us-west-1: 1
      us-west-2: 1
provisioning: cloud
   scenario:
      requests:
         - url: http://blazedemo.com/
           method: GET